fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ВКМ_НачислениеФиксированнойПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированнойПремии</name>
  <registerRecords>CalculationRegister.ВКМ_Начисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_НачисленияПремий</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_УдержанияСотрудников</registerRecords>
  <attributes>
    <name>МесяцНачисления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_НачисленияПремий/ВКМ_НачисленияПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_НачисленияПремий</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_УдержанияСотрудников/ВКМ_УдержанияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_УдержанияСотрудников</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_НачисленияПремий.Очистить();
	Движения.ВКМ_УдержанияСотрудников.Очистить();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
	
	Движения.ВКМ_НачисленияПремий.Записывать = Истина;
	Движения.ВКМ_УдержанияСотрудников.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	ПериодРегистрации = НачалоМесяца(МесяцНачисления);
	СтавкаНДФЛ = 13;
	
	Для Каждого СтрокаСписка Из СписокСотрудников Цикл
		
		СуммаПремии = СтрокаСписка.СуммаПремии;
		СуммаНДФЛ = Окр(СуммаПремии * СтавкаНДФЛ / 100, 2);
		
		// Начисление разовой фиксированной премии.
		Движение = Движения.ВКМ_НачисленияПремий.Добавить();
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
		Движение.Сотрудник = СтрокаСписка.Сотрудник;
		Движение.Результат = СуммаПремии;
		
		// Удержание НДФЛ с премии.
		Движение = Движения.ВКМ_УдержанияСотрудников.Добавить();
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.Сотрудник = СтрокаСписка.Сотрудник;
		Движение.Результат = СуммаНДФЛ;
		
		// Задолженность перед сотрудником: премия за вычетом удержанного НДФЛ.
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник = СтрокаСписка.Сотрудник;
		Движение.Сумма = СуммаПремии - СуммаНДФЛ;
		
	КонецЦикла;
	
	Движения.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
